Revit 2027 API
Document.GetSpaceAtPoint(XYZ) Method
Gets a space containing the point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Space GetSpaceAtPoint(
	XYZ point
)
Public Function GetSpaceAtPoint (
	point As XYZ
) As Space
public:
Space^ GetSpaceAtPoint(
	XYZ^ point
)
member GetSpaceAtPoint :
        point : XYZ -> Space
Parameters
point XYZ
Point to be checked.
Return Value
Space
The space containing the point.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the point is null.
ArgumentException |  Thrown when the coordinates of the point are not number or are Double::MaxValue or Double::MinValue.
Remarks
Surveys only the spaces from the final phase of the project. The first one found will be returned. If there is no space containing the point, it returns null.
See Also
Reference
Document Class
GetSpaceAtPoint Overload
Autodesk.Revit.DB Namespace